---
kind: other
id: Methods.T:Autodesk.Revit.DB.MEPSystemType
source: html/28d6f43c-5142-6a00-173c-9145a39270ba.htm
---
# MEPSystemType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.